[
  {"name": "bug", "color": "FF0000", "description": "Confirmed defects or unexpected behavior in code or functionality."},
  {"name": "feature", "color": "800080", "description": "New features or significant improvements, including integrations with external platforms."},
  {"name": "documentation", "color": "0000FF", "description": "Changes to READMEs, API docs, or contributor guides."},
  {"name": "chore", "color": "D3D3D3", "description": "Internal tasks like refactoring, dependency updates, or code cleanup."},
  {"name": "security", "color": "8B0000", "description": "Security vulnerabilities or concerns. Use private reporting per SECURITY.md; do not disclose publicly."},
  {"name": "compliance", "color": "0052CC", "description": "Issues addressing GDPR, CCPA, EU Data Act, or other regulatory requirements."},
  {"name": "module:zynconsent", "color": "008080", "description": "Issues or features specific to the ZynConsent privacy module."},
  {"name": "module:qynauth", "color": "4B0082", "description": "Issues or features specific to the QynAuth authentication module."},
  {"name": "module:valyze", "color": "808000", "description": "Issues or features specific to the Valyze valuation module."},
  {"name": "research", "color": "00FFFF", "description": "Exploratory tasks or prototyping, often pre-feature development."},
  {"name": "test", "color": "DDA0DD", "description": "Tasks related to writing, fixing, or improving unit, integration, or end-to-end tests."},
  {"name": "triage", "color": "FFA500", "description": "New issues needing initial review, categorization, and prioritization."},
  {"name": "blocked", "color": "FF4500", "description": "Work halted due to external dependencies or unresolved issues."},
  {"name": "in progress", "color": "ADD8E6", "description": "Issue or pull request currently being actively developed or investigated."},
  {"name": "awaiting review", "color": "90EE90", "description": "Pull request or issue ready for maintainer review or feedback."},
  {"name": "needs repro", "color": "FFFF00", "description": "Bug report or issue that needs a minimal reproducible example to proceed."},
  {"name": "needs discussion", "color": "FFC1CC", "description": "Issue requiring further input, clarification, or community/maintainer discussion before action."},
  {"name": "priority: critical", "color": "B22222", "description": "Immediate action required; impacts core functionality, security, or blocks critical paths."},
  {"name": "priority: high", "color": "DC143C", "description": "Important issue affecting user experience or module stability; should be addressed soon."},
  {"name": "good first issue", "color": "008000", "description": "Ideal for new contributors; low complexity, clear scope."},
  {"name": "help wanted", "color": "0000FF", "description": "Open for contributors; may require specific domain knowledge or collaboration."},
  {"name": "hacktoberfest", "color": "FF6200", "description": "Suitable for seasonal contributors or community events like Hacktoberfest."},
  {"name": "mentor available", "color": "00FF00", "description": "Mentorship is offered to help a contributor complete this task."},
  {"name": "v2:demo", "color": "FF00FF", "description": "Tasks specifically related to building out the unified MVP V2 end-to-end demo and core DX enhancements."},
  {"name": "epic", "color": "FFD700", "description": "Large-scale feature or milestone linking multiple issues or pull requests."},
  {"name": "community", "color": "FF69B4", "description": "Issues or features driven by community feedback or requests."}
]